; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v8 ?v11)
             (pred_1 ?v7 ?v6)
             (pred_6 ?v8 ?v6)
             (pred_5 ?v2 ?v8 )
	     (pred_12 ?v8)
             (pred_4 ?v10)
             (pred_3 ?v7)
             (pred_11 ?v6)
             (pred_10 ?v8)
             (pred_9 ?v7)
             (pred_2 ?v8)
             (pred_8 ))



(:action op_1
:parameters (?v4 ?v12 ?v13 ?v1)
:precondition (and (pred_4 ?v4) (pred_4 ?v12) (pred_3 ?v13) (pred_11 ?v1)
          (pred_7 ?v4 ?v12) (pred_1 ?v13 ?v1)
                   (pred_6 ?v12 ?v1) (pred_12 ?v4) 
                   (pred_10 ?v12) (pred_9 ?v13))
:effect (and  (pred_2 ?v12) (not (pred_10 ?v12))))


(:action op_4
:parameters (?v4 ?v3)
:precondition (and (pred_4 ?v4) (pred_4 ?v3)
               (pred_12 ?v4) (pred_7 ?v4 ?v3) (pred_2 ?v3))
:effect (and (pred_12 ?v3) (not (pred_12 ?v4))))

(:action op_2
:parameters (?v4 ?v13)
:precondition (and (pred_4 ?v4) (pred_3 ?v13) 
                  (pred_12 ?v4) (pred_5 ?v13 ?v4) (pred_8 ))
:effect (and (pred_9 ?v13)
   (not (pred_5 ?v13 ?v4)) (not (pred_8 ))))


(:action op_3
:parameters (?v4 ?v5 ?v9)
:precondition (and (pred_4 ?v4) (pred_3 ?v5) (pred_3 ?v9)
                  (pred_12 ?v4) (pred_9 ?v9) (pred_5 ?v5 ?v4))
:effect (and (pred_9 ?v5) (pred_5 ?v9 ?v4)
        (not (pred_9 ?v9)) (not (pred_5 ?v5 ?v4))))

(:action op_5
:parameters (?v4 ?v13)
:precondition (and (pred_4 ?v4) (pred_3 ?v13) 
                  (pred_12 ?v4) (pred_9 ?v13))
:effect (and (pred_8 ) (pred_5 ?v13 ?v4) (not (pred_9 ?v13)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_27 obj_07 obj_19 obj_03 obj_15 obj_05 obj_01 obj_04 obj_12 obj_26 obj_18 obj_08 obj_30 obj_17 obj_28 obj_02 obj_22 obj_23 obj_31 obj_20 obj_24 obj_13 obj_16 obj_21 obj_09
    obj_32 obj_11 obj_29
    obj_25 obj_14 obj_06 obj_10
    )

    (:init
       (pred_8)

       (pred_4 obj_27)
       (pred_4 obj_07)
       (pred_4 obj_19)
       (pred_4 obj_03)
       (pred_4 obj_15)
       (pred_4 obj_05)
       (pred_4 obj_01)
       (pred_4 obj_04)
       (pred_4 obj_12)
       (pred_4 obj_26)
       (pred_4 obj_18)
       (pred_4 obj_08)
       (pred_4 obj_30)
       (pred_4 obj_17)
       (pred_4 obj_28)
       (pred_4 obj_02)
       (pred_4 obj_22)
       (pred_4 obj_23)
       (pred_4 obj_31)
       (pred_4 obj_20)
       (pred_4 obj_24)
       (pred_4 obj_13)
       (pred_4 obj_16)
       (pred_4 obj_21)
       (pred_4 obj_09)
       (pred_11 obj_32)
       (pred_11 obj_11)
       (pred_11 obj_29)
       (pred_3 obj_25)
       (pred_3 obj_14)
       (pred_3 obj_06)
       (pred_3 obj_10)

       (pred_7 obj_27 obj_05)
       (pred_7 obj_27 obj_07)
       (pred_7 obj_07 obj_01)
       (pred_7 obj_07 obj_19)
       (pred_7 obj_07 obj_27)
       (pred_7 obj_19 obj_04)
       (pred_7 obj_19 obj_03)
       (pred_7 obj_19 obj_07)
       (pred_7 obj_03 obj_12)
       (pred_7 obj_03 obj_15)
       (pred_7 obj_03 obj_19)
       (pred_7 obj_15 obj_26)
       (pred_7 obj_15 obj_03)
       (pred_7 obj_05 obj_18)
       (pred_7 obj_05 obj_01)
       (pred_7 obj_05 obj_27)
       (pred_7 obj_01 obj_08)
       (pred_7 obj_01 obj_04)
       (pred_7 obj_01 obj_07)
       (pred_7 obj_01 obj_05)
       (pred_7 obj_04 obj_30)
       (pred_7 obj_04 obj_12)
       (pred_7 obj_04 obj_19)
       (pred_7 obj_04 obj_01)
       (pred_7 obj_12 obj_17)
       (pred_7 obj_12 obj_26)
       (pred_7 obj_12 obj_03)
       (pred_7 obj_12 obj_04)
       (pred_7 obj_26 obj_28)
       (pred_7 obj_26 obj_15)
       (pred_7 obj_26 obj_12)
       (pred_7 obj_18 obj_02)
       (pred_7 obj_18 obj_08)
       (pred_7 obj_18 obj_05)
       (pred_7 obj_08 obj_22)
       (pred_7 obj_08 obj_30)
       (pred_7 obj_08 obj_01)
       (pred_7 obj_08 obj_18)
       (pred_7 obj_30 obj_23)
       (pred_7 obj_30 obj_17)
       (pred_7 obj_30 obj_04)
       (pred_7 obj_30 obj_08)
       (pred_7 obj_17 obj_31)
       (pred_7 obj_17 obj_28)
       (pred_7 obj_17 obj_12)
       (pred_7 obj_17 obj_30)
       (pred_7 obj_28 obj_20)
       (pred_7 obj_28 obj_26)
       (pred_7 obj_28 obj_17)
       (pred_7 obj_02 obj_24)
       (pred_7 obj_02 obj_22)
       (pred_7 obj_02 obj_18)
       (pred_7 obj_22 obj_13)
       (pred_7 obj_22 obj_23)
       (pred_7 obj_22 obj_08)
       (pred_7 obj_22 obj_02)
       (pred_7 obj_23 obj_16)
       (pred_7 obj_23 obj_31)
       (pred_7 obj_23 obj_30)
       (pred_7 obj_23 obj_22)
       (pred_7 obj_31 obj_21)
       (pred_7 obj_31 obj_20)
       (pred_7 obj_31 obj_17)
       (pred_7 obj_31 obj_23)
       (pred_7 obj_20 obj_09)
       (pred_7 obj_20 obj_28)
       (pred_7 obj_20 obj_31)
       (pred_7 obj_24 obj_13)
       (pred_7 obj_24 obj_02)
       (pred_7 obj_13 obj_16)
       (pred_7 obj_13 obj_22)
       (pred_7 obj_13 obj_24)
       (pred_7 obj_16 obj_21)
       (pred_7 obj_16 obj_23)
       (pred_7 obj_16 obj_13)
       (pred_7 obj_21 obj_09)
       (pred_7 obj_21 obj_31)
       (pred_7 obj_21 obj_16)
       (pred_7 obj_09 obj_20)
       (pred_7 obj_09 obj_21)
       (pred_10 obj_17)
       (pred_10 obj_19)
       (pred_10 obj_15)
       (pred_10 obj_20)
       (pred_6  obj_17 obj_32)
       (pred_6  obj_19 obj_11)
       (pred_6  obj_15 obj_29)
       (pred_6  obj_20 obj_29)
       (pred_2 obj_27)
       (pred_2 obj_07)
       (pred_2 obj_03)
       (pred_2 obj_05)
       (pred_2 obj_01)
       (pred_2 obj_04)
       (pred_2 obj_12)
       (pred_2 obj_26)
       (pred_2 obj_18)
       (pred_2 obj_08)
       (pred_2 obj_30)
       (pred_2 obj_28)
       (pred_2 obj_02)
       (pred_2 obj_22)
       (pred_2 obj_23)
       (pred_2 obj_31)
       (pred_2 obj_24)
       (pred_2 obj_13)
       (pred_2 obj_16)
       (pred_2 obj_21)
       (pred_2 obj_09)

       (pred_1  obj_25 obj_32)
       (pred_1  obj_14 obj_11)
       (pred_1  obj_06 obj_29)
       (pred_1  obj_10 obj_11)
       (pred_5 obj_25 obj_07)
       (pred_5 obj_14 obj_31)
       (pred_5 obj_06 obj_23)
       (pred_5 obj_10 obj_12)
       (pred_12 obj_08)
    )

    (:goal (and
       (pred_5 obj_25 obj_03)
       (pred_5 obj_14 obj_18)
       (pred_5 obj_06 obj_01)
    ))
(:constraints
  (always (not (pred_12 obj_30)))
)
)

; plan
1. (op_4 obj_08 obj_22)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_22)
   goals met: 0 of 3
2. (op_4 obj_22 obj_23)
   deleted: (pred_12 obj_22)
   added: (pred_12 obj_23)
   goals met: 0 of 3
3. (op_4 obj_23 obj_31)
   deleted: (pred_12 obj_23)
   added: (pred_12 obj_31)
   goals met: 0 of 3
4. (op_2 obj_31 obj_14)
   deleted: (pred_5 obj_14 obj_31) (pred_8)
   added: (pred_9 obj_14)
   goals met: 0 of 3
5. (op_4 obj_31 obj_23)
   deleted: (pred_12 obj_31)
   added: (pred_12 obj_23)
   goals met: 0 of 3
6. (op_3 obj_23 obj_06 obj_14)
   deleted: (pred_9 obj_14) (pred_5 obj_06 obj_23)
   added: (pred_9 obj_06) (pred_5 obj_14 obj_23)
   goals met: 0 of 3
7. (op_4 obj_23 obj_22)
   deleted: (pred_12 obj_23)
   added: (pred_12 obj_22)
   goals met: 0 of 3
8. (op_4 obj_22 obj_08)
   deleted: (pred_12 obj_22)
   added: (pred_12 obj_08)
   goals met: 0 of 3
9. (op_4 obj_08 obj_01)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_01)
   goals met: 0 of 3
10. (op_5 obj_01 obj_06)
   deleted: (pred_9 obj_06)
   added: (pred_8) (pred_5 obj_06 obj_01)
   goals met: 1 of 3
11. (op_4 obj_01 obj_08)
   deleted: (pred_12 obj_01)
   added: (pred_12 obj_08)
   goals met: 1 of 3
12. (op_4 obj_08 obj_22)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_22)
   goals met: 1 of 3
13. (op_4 obj_22 obj_23)
   deleted: (pred_12 obj_22)
   added: (pred_12 obj_23)
   goals met: 1 of 3
14. (op_2 obj_23 obj_14)
   deleted: (pred_5 obj_14 obj_23) (pred_8)
   added: (pred_9 obj_14)
   goals met: 1 of 3
15. (op_4 obj_23 obj_22)
   deleted: (pred_12 obj_23)
   added: (pred_12 obj_22)
   goals met: 1 of 3
16. (op_4 obj_22 obj_08)
   deleted: (pred_12 obj_22)
   added: (pred_12 obj_08)
   goals met: 1 of 3
17. (op_4 obj_08 obj_01)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_01)
   goals met: 1 of 3
18. (op_4 obj_01 obj_07)
   deleted: (pred_12 obj_01)
   added: (pred_12 obj_07)
   goals met: 1 of 3
19. (op_1 obj_07 obj_19 obj_14 obj_11)
   deleted: (pred_10 obj_19)
   added: (pred_2 obj_19)
   goals met: 1 of 3
20. (op_3 obj_07 obj_25 obj_14)
   deleted: (pred_9 obj_14) (pred_5 obj_25 obj_07)
   added: (pred_9 obj_25) (pred_5 obj_14 obj_07)
   goals met: 1 of 3
21. (op_4 obj_07 obj_19)
   deleted: (pred_12 obj_07)
   added: (pred_12 obj_19)
   goals met: 1 of 3
22. (op_4 obj_19 obj_03)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_03)
   goals met: 1 of 3
23. (op_5 obj_03 obj_25)
   deleted: (pred_9 obj_25)
   added: (pred_8) (pred_5 obj_25 obj_03)
   goals met: 2 of 3
24. (op_4 obj_03 obj_19)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_19)
   goals met: 2 of 3
25. (op_4 obj_19 obj_07)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_07)
   goals met: 2 of 3
26. (op_2 obj_07 obj_14)
   deleted: (pred_5 obj_14 obj_07) (pred_8)
   added: (pred_9 obj_14)
   goals met: 2 of 3
27. (op_4 obj_07 obj_27)
   deleted: (pred_12 obj_07)
   added: (pred_12 obj_27)
   goals met: 2 of 3
28. (op_4 obj_27 obj_05)
   deleted: (pred_12 obj_27)
   added: (pred_12 obj_05)
   goals met: 2 of 3
29. (op_4 obj_05 obj_18)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_18)
   goals met: 2 of 3
30. (op_5 obj_18 obj_14)
   deleted: (pred_9 obj_14)
   added: (pred_8) (pred_5 obj_14 obj_18)
   goals met: 3 of 3
